MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX340F512H.PIC
      <edc:SFRDef edc:_addr="0x1F8810A0" edc:_begin="0x90" edc:_end="0x130" edc:_modsrc="DOS-00868_YPAA_int_evic.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC1" edc:desc="" edc:grp="INT" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC1" edc:nzwidth="0x20" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T1IS" edc:desc="" edc:mask="0x3" edc:name="T1IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="T1IP" edc:desc="" edc:mask="0x7" edc:name="T1IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC1IS" edc:desc="" edc:mask="0x3" edc:name="IC1IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="IC1IP" edc:desc="" edc:mask="0x7" edc:name="IC1IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC1IS" edc:desc="" edc:mask="0x3" edc:name="OC1IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="OC1IP" edc:desc="" edc:mask="0x7" edc:name="OC1IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="INT1IS" edc:desc="" edc:mask="0x3" edc:name="INT1IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="INT1IP" edc:desc="" edc:mask="0x7" edc:name="INT1IP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8810B0" edc:_begin="0x90" edc:_end="0x130" edc:_modsrc="DOS-00868_YPAA_int_evic.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC2" edc:desc="" edc:grp="INT" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC2" edc:nzwidth="0x20" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T2IS" edc:desc="" edc:mask="0x3" edc:name="T2IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="T2IP" edc:desc="" edc:mask="0x7" edc:name="T2IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC2IS" edc:desc="" edc:mask="0x3" edc:name="IC2IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="IC2IP" edc:desc="" edc:mask="0x7" edc:name="IC2IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC2IS" edc:desc="" edc:mask="0x3" edc:name="OC2IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="OC2IP" edc:desc="" edc:mask="0x7" edc:name="OC2IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="INT2IS" edc:desc="" edc:mask="0x3" edc:name="INT2IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="INT2IP" edc:desc="" edc:mask="0x7" edc:name="INT2IP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8810C0" edc:_begin="0x90" edc:_end="0x130" edc:_modsrc="DOS-00868_YPAA_int_evic.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC3" edc:desc="" edc:grp="INT" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC3" edc:nzwidth="0x20" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T3IS" edc:desc="" edc:mask="0x3" edc:name="T3IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="T3IP" edc:desc="" edc:mask="0x7" edc:name="T3IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC3IS" edc:desc="" edc:mask="0x3" edc:name="IC3IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="IC3IP" edc:desc="" edc:mask="0x7" edc:name="IC3IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC3IS" edc:desc="" edc:mask="0x3" edc:name="OC3IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="OC3IP" edc:desc="" edc:mask="0x7" edc:name="OC3IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="INT3IS" edc:desc="" edc:mask="0x3" edc:name="INT3IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="INT3IP" edc:desc="" edc:mask="0x7" edc:name="INT3IP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8810D0" edc:_begin="0x90" edc:_end="0x130" edc:_modsrc="DOS-00868_YPAA_int_evic.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC4" edc:desc="" edc:grp="INT" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC4" edc:nzwidth="0x20" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T4IS" edc:desc="" edc:mask="0x3" edc:name="T4IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="T4IP" edc:desc="" edc:mask="0x7" edc:name="T4IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC4IS" edc:desc="" edc:mask="0x3" edc:name="IC4IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="IC4IP" edc:desc="" edc:mask="0x7" edc:name="IC4IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC4IS" edc:desc="" edc:mask="0x3" edc:name="OC4IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="OC4IP" edc:desc="" edc:mask="0x7" edc:name="OC4IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="INT4IS" edc:desc="" edc:mask="0x3" edc:name="INT4IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="INT4IP" edc:desc="" edc:mask="0x7" edc:name="INT4IP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
